package edu.sl.grabalyze.processing.stemming;

import junit.framework.TestCase;
import org.junit.Test;

/**
 * User: YM
 * Date: 15.04.13
 * Time: 22:33
 */
public class RussianStemmerTest extends TestCase {
    private static final String[] words = new String[] {"в", "вавиловка", "вагнера", "вагон", "вагона", "вагоне",
            "вагонов", "вагоном", "вагоны", "важная", "важнее", "важнейшие", "важнейшими", "важничал", "важно",
            "важного", "важное", "важной", "важном", "важному", "важности", "важностию", "важность", "важностью",
            "важную", "важны", "важные", "важный", "важным", "важных", "вазах", "вазы", "вакса", "вакханка", "вал",
            "валандался", "валентина", "валериановых", "валерию", "валетами", "вали", "валил", "валился", "валится",
            "валов", "вальдшнепа", "вальс", "вальса", "вальсе", "вальсишку", "вальтера", "валяется", "валялась",
            "валялись", "валялось", "валялся", "валять", "валяются", "вам", "вами",
            "п", "па", "пава", "павел", "павильон", "павильонам", "павла", "павлиний", "павлиньи", "павлиньим",
            "павлович", "павловна", "павловне", "павловной", "павловну", "павловны", "павловцы", "павлыч", "павлыча",
            "пагубная", "падает", "падай", "падал", "падала", "падаль", "падать", "падаю", "падают", "падающего",
            "падающие", "падеж", "падение", "падением", "падении", "падений", "падения", "паденье", "паденья", "падет",
            "падут", "падучая", "падчерицей", "падчерицы", "падшая", "падшей", "падшему", "падший", "падшим", "падших",
            "падшую", "паек", "пазухи", "пазуху", "пай", "пакет", "пакетом", "пакеты", "пакостей", "пакостно", "пал"};

    private static final String[] stemms = new String[] {"в", "вавиловк", "вагнер", "вагон", "вагон", "вагон", "вагон", 
            "вагон", "вагон", "важн", "важн", "важн", "важн", "важнича", "важн", "важн", "важн", "важн", "важн", "важн", 
            "важност", "важност", "важност", "важност", "важн", "важн", "важн", "важн", "важн", "важн", "ваз", "ваз", 
            "вакс", "вакханк", "вал", "валанда", "валентин", "валерианов", "валер", "валет", "вал", "вал", "вал", "вал", 
            "вал", "вальдшнеп", "вальс", "вальс", "вальс", "вальсишк", "вальтер", "валя", "валя", "валя", "валя", 
            "валя", "валя", "валя", "вам", "вам", "п", "па", "пав", "павел", "павильон", "павильон", "павл", "павлин", 
            "павлин", "павлин", "павлович", "павловн", "павловн", "павловн", "павловн", "павловн", "павловц", "павлыч", 
            "павлыч", "пагубн", "пада", "пада", "пада", "пада", "падал", "пада", "пада", "пада", "пада", "пада", 
            "падеж", "паден", "паден", "паден", "паден", "паден", "паден", "паден", "падет", "падут", "падуч", 
            "падчериц", "падчериц", "падш", "падш", "падш", "падш", "падш", "падш", "падш", "паек", "пазух", "пазух", 
            "па", "пакет", "пакет", "пакет", "пакост", "пакостн", "пал"};
    
    public void testStem() {
        Stemmer stemmer = new RussianStemmer();
        assertEquals(words.length,stemms.length);
        String stem;
        for (int i = 0; i < words.length; i++) {
            System.out.println(words[i]);
            stem = stemmer.stem(words[i]);
            assertEquals("stem(" + words[i] + ") should be equal to " + stemms[i] + ", not " + stem + "!",
                    stem, stemms[i]);
        }
    }
}
