package edu.sl.grabalyze.processing.stemming.impl;

import junit.framework.TestCase;
import org.junit.Test;

import edu.sl.grabalyze.processing.stemming.Stemmer;

public class UkrainianStemmerTest extends TestCase {
    private static final String[] words = new String[] {"в", "Вавіловка", "Вагнера", "вагон", "вагона", "вагоні", "вагонів", 
        "вагоном", "вагони", "важлива", "важливіше", "найважливіші", "найважливішими", "величався", "важливо", "важливого", 
        "важливе", "важливою", "важливому", "важливого", "важливості", "важливість", "важливість", "важливістю", "важливу", 
        "важливі", "важливі", "важливий", "важливим", "важливих", "вазах", "вази", "вакса", "вакханка", "вал", "валандался", 
        "валентина", "валеріанових", "Валерію", "валетами", "вали", "валив", "валився", "валиться", "валів", "вальдшнепа", 
        "вальс", "вальсу", "вальсі", "вальсішку", "вальтера", "валяється", "валялася", "валялися", "валялося", "валявся", 
        "валяти", "валяються", "вам", "вами", "п", "па", "пава", "павел", "павільйон", "павільйонах", "павла", "павине", 
        "павині", "павичевим", "павлович", "павловна", "Павлівні", "Павлівною", "Павлівну", "Павлівни", "Павловца", 
        "Паволоч", "Паволоч", "пагубна", "падає", "падай", "падав", "падала", "падаль", "падати", "падаю", "падають", 
        "падаючого", "падаючі", "відмінок", "падіння", "падінням", "падінні", "падінь", "падіння", "паденье", "паденья", 
        "впаде", "попадають", "падуча", "падчеркою", "падчерки", "занепала", "занепалої", "занепалого", "занепалий", 
        "занепалим", "занепалих", "занепалу", "пайок", "пазухи", "пазуху", "пай", "пакет", "пакетом", "пакети", "капостей", 
        "капосно", "упав"};

    private static final String[] stemms = new String[] {"в", "вавиловк", "вагнер", "вагон", "вагон", "вагон", "вагон", 
            "вагон", "вагон", "важн", "важн", "важн", "важн", "важнича", "важн", "важн", "важн", "важн", "важн", "важн", 
            "важност", "важност", "важност", "важност", "важн", "важн", "важн", "важн", "важн", "важн", "ваз", "ваз", 
            "вакс", "вакханк", "вал", "валанда", "валентин", "валерианов", "валер", "валет", "вал", "вал", "вал", "вал", 
            "вал", "вальдшнеп", "вальс", "вальс", "вальс", "вальсишк", "вальтер", "валя", "валя", "валя", "валя", 
            "валя", "валя", "валя", "вам", "вам", "п", "па", "пав", "павел", "павильон", "павильон", "павл", "павлин", 
            "павлин", "павлин", "павлович", "павловн", "павловн", "павловн", "павловн", "павловн", "павловц", "павлыч", 
            "павлыч", "пагубн", "пада", "пада", "пада", "пада", "падал", "пада", "пада", "пада", "пада", "пада", 
            "падеж", "паден", "паден", "паден", "паден", "паден", "паден", "паден", "падет", "падут", "падуч", 
            "падчериц", "падчериц", "падш", "падш", "падш", "падш", "падш", "падш", "падш", "паек", "пазух", "пазух", 
            "па", "пакет", "пакет", "пакет", "пакост", "пакостн", "пал"};
    
    public void testStem() {
        Stemmer stemmer = new RussianStemmer();
        assertEquals(words.length,stemms.length);
        String stem;
        for (int i = 0; i < words.length; i++) {
            stem = stemmer.stem(words[i]);
            assertEquals("stem(" + words[i] + ") should be equal to " + stemms[i] + ", not " + stem + "!",
                    stem, stemms[i]);
        }
    }
}
